---
kind: method
id: M:Autodesk.Revit.DB.Lighting.AdvancedLossFactor.#ctor(Autodesk.Revit.DB.Lighting.AdvancedLossFactor)
source: html/6ff9b7cb-c8db-6b78-abcb-e09e84afb075.htm
---
# Autodesk.Revit.DB.Lighting.AdvancedLossFactor.#ctor Method

Creates a copy of the given advanced loss factor object

## Syntax (C#)
```csharp
public AdvancedLossFactor(
	AdvancedLossFactor other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.AdvancedLossFactor`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null